app/controllers/articles_controller.rb

  def create
    # Make the new article record
    puts 'Creating article'
    @article = Article.create(article_params)
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a sample"], ["body", "This is a sample article"], ["created_at", "2016-03-13 14:51:49.974104"], ["updated_at", "2016-03-13 14:51:49.974104"]]